/*
*********************************************************************************************************
*	                                  
*	模块名称 : 应用程序配置文件
*	文件名称 : app_cfg.h
*	版    本 : V1.0
*	说    明 : uCOS-II任务配置文件。
*********************************************************************************************************
*/

#ifndef  __APP_CFG_H__
#define  __APP_CFG_H__


/*
*********************************************************************************************************
*                                              TASKS NAMES
*********************************************************************************************************
*/

#define  APP_TASK_START_NAME                          "Start Task"
#define  APP_TASK_GUI_NAME                            "ucGUI"
#define  APP_TASK_USER_IF_NAME                        "Touch.JoyStick"
#define  APP_TASK_COM_NAME                            "LED"
#define  APP_TASK_UPDATE_NAME                         "ucGUI Update"

/*
*********************************************************************************************************
*                                            TASK PRIORITIES
*********************************************************************************************************
*/
/* 启动任务 */
#define  APP_TASK_START_PRIO                               1
/* 触摸和JOYSTICK任务 */
#define  APP_TASK_USER_IF_PRIO                             4
/* LED任务 */
#define  APP_TASK_COM_PRIO								   3

/* GUI图片更新任务 */
#define  APP_TASK_UPDATE_PRIO							   2

/* GUI显示任务 */
#define  APP_TASK_GUI_PRIO               (OS_LOWEST_PRIO - 3)
#define  OS_TASK_TMR_PRIO                (OS_LOWEST_PRIO - 2)

/*
*********************************************************************************************************
*                                            TASK STACK SIZES
*                             Size of the task stacks (# of OS_STK entries)
*********************************************************************************************************
*/

#define  APP_TASK_START_STK_SIZE                         256
#define  APP_TASK_GUI_STK_SIZE                           1024
#define  APP_TASK_USER_IF_STK_SIZE                       128
#define  APP_TASK_COM_STK_SIZE							 128
#define  APP_TASK_UPDATE_STK_SIZE						 512
/*
*********************************************************************************************************
*                                           信号量，邮箱，动态内存等
*                             
*********************************************************************************************************
*/



#endif
