/*
*********************************************************************************************************
*	                                  
*	模块名称 : LED指示灯驱动模块
*	文件名称 : bsp_led.c
*	版    本 : V1.0
*	说    明 : LED例程。
*	修改记录 :
*		版本号    日期          作者                 说明
*		v1.0    2011-11-01   WildFire Team  ST固件库版本 V3.5.0版本。
*
*	Copyright (C), 2012-2013, WildFire Team
*********************************************************************************************************
*/

#include "stm32f10x.h"
#include "bsp_led.h"

/*
	野火开发板LED指示灯口线分配：
	LED1 : PC3  低电平点亮
	LED2 : PC4  低电平点亮	
	LED3 : PC5  低电平点亮	
*/

/*
*********************************************************************************************************
*	函 数 名: bsp_InitLed
*	功能说明: 初始化LED指示灯
*	形    参：无
*	返 回 值: 无 
	配置所有的LED指示灯GPIO为推挽输出模式
	由于将GPIO设置为输出时，GPIO输出寄存器的值缺省是0，因此会驱动LED点亮
	浮动输入模式 CPU复位后就是这个状态
*********************************************************************************************************
*/
void bsp_InitLed(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;


	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
	GPIO_SetBits(GPIOC,GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5);	 /* 防止输出低电平全亮 */
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
 	
}

/*
*********************************************************************************************************
*	函 数 名: bsp_LedOn
*	功能说明: 点亮指定的LED指示灯。
*	形    参：_no : 指示灯序号，范围 1 - 4, 0表示全部
*	返 回 值: 按键代码
    寄存器设置BRR或BSRR 只能通过1 不可以通过0
*********************************************************************************************************
*/
void bsp_LedOn(uint8_t _no)
{
	if (_no == 0)
	{
		LED1=0;
		LED2=0;
		LED3=0;
		return;
	}
	_no--;
	if (_no == 0)
	{
		LED1=0;
	}
	else if (_no == 1)
	{
		LED2=0;
	}
	else if (_no == 2)
	{
		LED3=0;
	}		
}

/*
*********************************************************************************************************
*	函 数 名: bsp_LedOff
*	功能说明: 熄灭指定的LED指示灯。
*	形    参：_no : 指示灯序号，范围 1 - 4
*	返 回 值: 按键代码
*********************************************************************************************************
*/
void bsp_LedOff(uint8_t _no)
{
	if (_no == 0)
	{
		LED1=1;
		LED2=1;
		LED3=1;
		return;
	}
	_no--;
	if (_no == 0)
	{
		LED1=1;
	}
	else if (_no == 1)
	{
		LED2=1;
	}
	else if (_no == 2)
	{
		LED3=1;
	}				
}

/*
*********************************************************************************************************
*	函 数 名: bsp_LedToggle
*	功能说明: 翻转指定的LED指示灯。
*	形    参：_no : 指示灯序号，范围 1 - 4， 0表示全部
*	返 回 值: 按键代码
*********************************************************************************************************
*/
void bsp_LedToggle(uint8_t _no)
{
	if (_no == 0)
	{
		LED1^=1;
		LED2^=1;
		LED3^=1;
		return;
	}
	_no--;
	if (_no == 0)
	{
		LED1^=1;
	}
	else if (_no == 1)
	{
		LED2^=1;
	}
	else if (_no == 2)
	{
		LED3^=1;
	}				
}

