/**
  ******************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2013-xx-xx
  * @brief   野火 ISO STM32 开发板整板测试
  ******************************************************************************
  * @attention
  *
  * 实验平台:野火 iSO STM32 开发板 
  * 论坛    :http://www.chuxue123.com
  * 淘宝    :http://firestm32.taobao.com
  *
  ******************************************************************************
  */ 

#include "bsp_iso_test.h"


/**
  * @brief  主函数
  * @param  无  
  * @retval 无
  */
int main(void)
{  
  ISO_Test();

	while( 1 ){}
}


/* ----------------------------------------end of file------------------------------------------------ */

